// Разумовский Дмитрий

// 16 OpenServer (Windows)

Для Mac - самим

MySQL-client: NAvicat (платный), PhpShtorm, WorkBench

// 35 Рабочее окружение

PhpShtorm - есть купоны на 3 месяца

Есть скринкаст по установке OpenServer

Понадобятся:
Модули (Apache+PHP-7.62)
PHP - последней версии 7.2
MySQL - не особо нужна последняя версия, можно 5.6

В папке 'Domains' создаем проект: внутри OpenServer
есть 'domains', внутри нее - папки

// 45 - Git

Откатит изменения и подчистит все
$git reset --hard && git clean -fd

// 63 - прописывание пароля к GIT

$ssh-keygen

Сгенерирует ssh-key

В каталоге будет сгенерировано два ключа для шифрования - отк и закр

Открытый ключ добавляем на гите в соотв раздел

// 83 - PSR-2

